namespace Frendy.Shared.Enums;

/// <summary>
/// Перечисление возможных ролей пользователя
/// </summary>
public enum UserRole
{
    /// <summary>
    /// Пользователь с минимальными правами
    /// </summary>
    User = 1,
    
    /// <summary>
    /// Пользователь с расширенными правами, может помогать другим пользователям
    /// </summary>
    Support = 2,
    
    /// <summary>
    /// Пользователь с правами модерации, может блокировать пользователей и удалять их контент
    /// </summary>
    Moderator = 3,
    
    /// <summary>
    /// Пользователь с правами администратора, может управлять всеми пользователями и их контентом
    /// </summary>
    Administrator = 4
}